#include "iostream"
using namespace std;
/*
 反斜杠可以和8进制或16进制数值结合起来使用，以表示相应于该数值的ASC码
 8进制最多是3位数，‘、000’~‘、377’即0到255
 16进制最多是2位数，用x或者‘X’引导，表示的范围是‘\x00’~'\xff'
 字符形式            值            功能
 \a------------------0x07----------响铃
 \n------------------0x0A----------换行
 \t------------------0x09----------制表符
 \v------------------0x0B----------竖向跳格
 \b------------------0x08----------退格
 \r------------------0x0D----------回车
 \\------------------0x5c----------反斜杠字符“\”
 \"------------------0x22----------双引号
 \'------------------0x27----------单引号
 \ddd------------------------------1~3位八进制数
 \xhh------------------------------1~2位十六进制数
*/
void main(){
	cout << "\x07operating\tsystem\n";
}